{"class_name": "Functional", "config": {"name": "decoder", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [4000, 24], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_10"}, "registered_name": null, "name": "input_10", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_27", "trainable": true, "dtype": "float32", "units": 24, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [4000, 24]}, "name": "dense_27", "inbound_nodes": [[["input_10", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_36", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [4000, 24]}, "name": "re_lu_36", "inbound_nodes": [[["dense_27", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_28", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [4000, 24]}, "name": "dense_28", "inbound_nodes": [[["re_lu_36", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_37", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [4000, 64]}, "name": "re_lu_37", "inbound_nodes": [[["dense_28", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_29", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [4000, 64]}, "name": "dense_29", "inbound_nodes": [[["re_lu_37", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_38", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [4000, 128]}, "name": "re_lu_38", "inbound_nodes": [[["dense_29", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Reshape", "config": {"name": "reshape_9", "trainable": true, "dtype": "float32", "target_shape": [4, 4, 8]}, "registered_name": null, "build_config": {"input_shape": [4000, 128]}, "name": "reshape_9", "inbound_nodes": [[["re_lu_38", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_9", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "registered_name": null, "build_config": {"input_shape": [4000, 4, 4, 8]}, "name": "conv2d_transpose_9", "inbound_nodes": [[["reshape_9", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_9", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "registered_name": "SlicingOpLambda", "build_config": {"input_shape": [4000, 9, 9, 1]}, "name": "tf.__operators__.getitem_9", "inbound_nodes": [["conv2d_transpose_9", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 0, "stop": 8, "step": null}, {"start": 0, "stop": 8, "step": null}]}]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_39", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [4000, 8, 8, 1]}, "name": "re_lu_39", "inbound_nodes": [[["tf.__operators__.getitem_9", 0, 0, {}]]]}], "input_layers": [["input_10", 0, 0]], "output_layers": [["re_lu_39", 0, 0]]}, "keras_version": "2.13.1", "backend": "tensorflow"}