{"class_name": "Functional", "config": {"name": "decoder", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [4000, 24], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_11"}, "registered_name": null, "name": "input_11", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_30", "trainable": true, "dtype": "float32", "units": 24, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [4000, 24]}, "name": "dense_30", "inbound_nodes": [[["input_11", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_40", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [4000, 24]}, "name": "re_lu_40", "inbound_nodes": [[["dense_30", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_31", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [4000, 24]}, "name": "dense_31", "inbound_nodes": [[["re_lu_40", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_41", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [4000, 64]}, "name": "re_lu_41", "inbound_nodes": [[["dense_31", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_32", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [4000, 64]}, "name": "dense_32", "inbound_nodes": [[["re_lu_41", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_42", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [4000, 128]}, "name": "re_lu_42", "inbound_nodes": [[["dense_32", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Reshape", "config": {"name": "reshape_10", "trainable": true, "dtype": "float32", "target_shape": [4, 4, 8]}, "registered_name": null, "build_config": {"input_shape": [4000, 128]}, "name": "reshape_10", "inbound_nodes": [[["re_lu_42", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_10", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "registered_name": null, "build_config": {"input_shape": [4000, 4, 4, 8]}, "name": "conv2d_transpose_10", "inbound_nodes": [[["reshape_10", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_10", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "registered_name": "SlicingOpLambda", "build_config": {"input_shape": [4000, 9, 9, 1]}, "name": "tf.__operators__.getitem_10", "inbound_nodes": [["conv2d_transpose_10", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 0, "stop": 8, "step": null}, {"start": 0, "stop": 8, "step": null}]}]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_43", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [4000, 8, 8, 1]}, "name": "re_lu_43", "inbound_nodes": [[["tf.__operators__.getitem_10", 0, 0, {}]]]}], "input_layers": [["input_11", 0, 0]], "output_layers": [["re_lu_43", 0, 0]]}, "keras_version": "2.13.1", "backend": "tensorflow"}